package main

import "fmt"

func main() {
	var chartype int8 = 'R'

	fmt.Printf("Code '%c' - %d\n", chartype, chartype)

	//Задание.
	//1. Вывести украинскую букву 'Ї'
	//2. Пояснить назначение типа "rune"

	//Задание.
	//1. Вывести украинскую букву 'Ї'
	fmt.Printf("Ї")
	//2. Пояснить назначение типа "rune"
	// Символьний тип (rune) – тип даних, призначений для зберігання
	// одного символу (керуючого або друкованого) в певному кодуванні. Може
	// бути як однобайтовим, так і мультибайтним. Символьні літерали
	// визначаються за допомогою одинарних лапок (').
}
